<template>
    <div class="about container">
        <img class="about__picture" :src="data.img" alt="my photo">
        <div class="about__text-content">
            <h1>Информация обо мне</h1>
            <p class="about__history" v-html="data.text"></p>
            <hr>
            <p><strong>{{ data.edu }}</strong></p>
            <p><strong>Преподаваемые дисциплины:</strong></p>
            <ul>
                <li
                    v-for="(item, index) in data.disciplines"
                    :key="index"
                >
                    {{ item }};
                </li>
            </ul>
        </div>
    </div>
</template>

<script setup>
const data = {
    img: "images/about/about_picture.jpg",
    text: "Привет, меня зовут Анна! <br/> " +
        "С 2008 года являюсь преподавателем информационных технологий областного государственного бюджетного профессионального образовательного учреждения Томского экономико-промышленного колледжа, а также экспертом по компетенции «Автоматизация бизнес-процессов организаций»:<br>" +
        "- с правом оценки демонстрационного экзамена по стандартам WorldSkills Russia;<br>" +
        "- конкурсов по профессиональному мастерству «Абилимпикс».<br>" +
        "<span style='color: #5E3BEE'>Имею опыт программирования в 1С, Visual Studio, MySQL, phpMyAdmin, работала с различными системами учета, взаимодействовала с контролирующими и проверяющими органами.</span> <br/>" +
        "<span style='color: #5E3BEE'>Владею такими программами как: 1С, ДОМИНО, Photoshop, Компас -3D, Blender и пр.</span><br>" +
        "Отличаюсь внимательным и ответственным подходом к делу. Люблю обучать и обучаться. Отличительная черта моего характера заключается в том, что я максимально открыта и с огромной радостью делюсь не только программными знаниями, но и личными секретами профессионального мастерства, тонкостями профессии. <br/>" +
        "<br>Среди своих студентов мечтаю видеть целеустремленных и энергичных людей с чувством юмора и острым умом. <br/>" +
        "Если это про вас — мы точно поладим и сможем извлечь максимальную пользу из совместных занятий.",
    edu: 'Образование, специальность по диплому: Высшее. Бакалавр 09.03.03 Прикладная информатика ТУСУР, 2020г. Квалификационная категория (дата ее присвоения): первая квалификационная категория 2016г. (согласно протоколу № 16-9 от 31 января 2017г.)',
    disciplines: [
        'Основы алгоритмизации и программирования',
        'МДК.01.03 Разработка мобильных приложений',
        'МДК.01.04 Системное программирование',
        'УП.11 по ПМ.11',
        'МДК.11.01 Технология разработки и защиты баз данных',
        'УП.01 по ПМ.01',
        'МДК.01.01 Разработка программных модулей',
        'МДК.01.02 Поддержка и тестирование программных модулей',
        'МДК.13.03 Проектирование и разработка кода информационных систем',
        'Основы проектирования баз данных'
    ]
}
</script>

<style scoped lang="scss">
.about {
    display: flex;
    justify-content: center;
    margin: 30px 0px;
    max-width: 100%;
    gap: 30px;

    @include _1300 {
        flex-direction: column;
        align-items: center;
    }

    h1 {
        margin-bottom: 20px;
        text-align: center;
    }

    &__picture {
        max-width: 48%;
        width: 100%;
        border-radius: 10px;
    }

    &__text-content {
        background-color: white;
        border-radius: 10px;
        box-shadow: 0 0 6px rgba(61, 61, 61, 0.5);
        padding: 15px;
    }

    &__history span {
        color: $primary;
    }

    hr {
        margin: 20px 0;
        border-color: $primary;
    }

    ul {
        display: flex;
        flex-direction: column;
        gap: 10px;

        li {
            margin-left: 15px;
        }
    }

}
</style>
