<template>
  <div v-for="item in data" :key="item.id" class="col-span-1">
    <div class="card grow">
      <div class="card-header">
        <h3 class="text-base font-semibold">
          {{ item.title }}
        </h3>
      </div>
      <div class="card-body">
        <p v-for="(text, index) in item.description" :key="index"
           class="text-sm text-gray-700 font-medium leading-5.5 mb-4">
          {{ text }}
        </p>
      </div>
    </div>
  </div>
</template>
<script setup lang="ts">
const data = [
  {
    id: 1,
    title: 'Обо мне',
    description: [
      'С 2008 года являюсь преподавателем информационных технологий областного государственного бюджетного профессионального образовательного учреждения Томского экономико-промышленного колледжа, а также экспертом по компетенции «Автоматизация бизнес-процессов организаций»:',
      '- с правом оценки демонстрационного экзамена в соответствии со стандартами WorldSkills Russia.',
      '- конкурсов по профессиональному мастерству «Абилимпикс».'
    ],
  },
  {
    id: 2,
    title: 'Soft skills',
    description: [
      'Отличаюсь внимательным и ответственным подходом к делу. Максимально открыта и с огромной радостью делюсь не только программными знаниями, но и личными секретами профессионального мастерства, тонкостями профессии.',
      'Среди своих студентов мечтаю видеть целеустремленных и энергичных людей с чувством юмора и острым умом.',
      'Если это про вас — мы точно поладим и извлечем максимальную пользу из совместных занятий.'
    ],
  }
]
</script>